{
  "url": "https://rss.nytimes.com/services/xml/rss/nyt/Politics.xml",
  "content": "**RSS News Feed**\n\n**New China Trade ‘Deal’ Takes U.S. Back to Where It Started**\nIf a handshake agreement holds, it would merely undo some of the damage from the trade war that President Trump started.\n\n---\n\n**In Trump’s Washington, ‘You Don’t Leave Home Without Your Lawyer’**\nThere’s a lot of work for lawyers in the nation’s capital these days: Over 400 lawsuits have been filed against President Trump’s administration since the start of his second term.\n\n---\n\n**Suggesting More Troops in More Cities, Trump Bends Military’s Role**\nPresident Trump has expanded domestic use of the armed forces, testing the limits on involving troops at protests and the border.\n\n---\n\n**No, Not That Lee. Pentagon Finds Black Hero to Rechristen Base Long Named for Robert E.**\nThe Army unveiled a list of seven installations that the Trump administration is reverting, sort of, to earlier names venerating Confederate heroes.\n\n---\n\n**Kosovo will accept up to 50 deported migrants from America.**\n\n---\n\n**McConnell Tells Hegseth U.S. Reputation Is at Stake in Ukraine War**\nA testy exchange between a senator who strongly supports Ukraine aid and the defense secretary revealed a deepening split among G.O.P. officials on the war.\n\n---\n\n**U.S. to Evacuate Diplomats From Iraq Amid Iran Tensions**\nThe State Department said it had decided to shrink the U.S. “footprint” in Baghdad and the United Kingdom issued a warning about “increased tensions within the region.”\n\n---\n\n**Trumps to Attend ‘Les Misérables’ at Kennedy Center**\nThe president and first lady are scheduled to attend the opening night of the musical, one of his favorites, after he seized control of the cultural institution.\n\n---\n\n**Senate Republicans Want to Trim Some of Trump’s Tax Cuts in Domestic Policy Bill**\nG.O.P. senators are considering whether to further curb the president’s favorite tax cuts as they rewrite key portions of the sprawling domestic agenda bill passed by the House.\n\n---\n\n**Musk Called Trump Privately Before Posting Message of ‘Regret’**\nIt remains to be seen how Mr. Trump will handle the attempted rapprochement and whether the two men’s relationship can be restored.\n\n---\n\n**Newsom portraying himself as the hero to Trump’s ‘Star Wars’ villain.**\nGov. Gavin Newsom of California, widely seen as having 2028 aspirations, had taken a conciliatory approach toward right-wing figures in recent months. Now, he’s ramping up the aggressive rhetoric.\n\n---\n\n**Why California Says Trump’s Military Deployment Is Illegal**\nCalifornia has sued the Trump administration over its move to deploy troops to Los Angeles. Eric Schmitt, a national security correspondent for The New York Times, explains the laws governing the use of American troops on U.S. soil.\n\n---\n\n**Fulbright Board Quits, Accusing Trump Administration of Political Interference**\nThe board of the prestigious program told the State Department it had no right to cancel scholarships for nearly 200 American professors and researchers.\n\n---\n\n**Trump’s Pick for F.A.A. Leader Is Grilled Over Views on Pilot Training and Safety**\nThe confirmation hearing for Bryan Bedford, a commercial airline executive, came as the agency confronts critical staffing shortages and questions about passenger safety.\n\n---\n\n**Eleanor Holmes Norton, D.C.’s Delegate in Congress, Clings to Seat Amid Signs of Decline**\nColleagues and friends say Representative Eleanor Holmes Norton, the District of Columbia’s 87-year-old nonvoting delegate and a veteran of fights over home rule, is struggling to do her job.",
  "timestamp": "2025-06-11T18:54:20.920388",
  "error": null,
  "metadata": {
    "content_type": "rss_feed",
    "items_count": 15,
    "feed_title": "RSS News Feed",
    "source": "secure_web_search",
    "original_query": "what is the latest political news for today?",
    "fetch_method": "SAM_WebFetcher",
    "quarantine_timestamp": "2025-06-11T18:54:20.920705"
  },
  "vetting_results": {
    "status": "completed",
    "timestamp": "2025-06-11T20:05:39.601356",
    "processing_time": 0.0012612342834472656,
    "recommendation": "FAIL",
    "confidence": 0.52928,
    "reason": "Low overall quality score (0.43); Content lacks credible sources and evidence (credibility: 0.20)",
    "overall_score": 0.43,
    "scores": {
      "credibility": 0.2,
      "persuasion": 0.0,
      "speculation": 0.0,
      "purity": 0.8,
      "source_reputation": 0.6
    },
    "source_reputation": {
      "domain": "rss.nytimes.com",
      "tld": ".com",
      "base_score": 0.6,
      "trusted_bonus": 0.0,
      "suspicious_penalty": 0.0,
      "factor_adjustments": -0.05,
      "final_score": 0.5499999999999999,
      "risk_category": "medium_risk",
      "https_used": true
    },
    "risk_assessment": {
      "overall_score": 0.43,
      "risk_factors": [
        {
          "dimension": "credibility",
          "score": 0.2,
          "threshold": 0.4,
          "severity": "high",
          "description": "Content lacks credible sources and evidence"
        }
      ],
      "confidence": 0.52928,
      "analysis_mode": "balanced",
      "weights_used": {
        "credibility": 0.3,
        "persuasion": 0.25,
        "speculation": 0.2,
        "purity": 0.15,
        "source_reputation": 0.1
      }
    },
    "sanitization": {
      "removed_elements": [],
      "suspicious_patterns": [],
      "purity_score": 0.9,
      "encoding_issues": [
        "non_ascii_characters",
        "excessive_control_chars"
      ],
      "content_stats": {
        "original_length": 3526,
        "clean_length": 3497,
        "reduction_ratio": 0.008224617129892198,
        "word_count": 547,
        "line_count": 1,
        "non_ascii_ratio": 0.008578781812982557
      }
    },
    "metadata": {
      "profile_used": "web_vetting",
      "analysis_mode": "balanced",
      "evaluator_version": "1.0",
      "safety_threshold": 0.7
    }
  }
}