{
  "url": "https://feeds.bbci.co.uk/news/rss.xml",
  "content": "**RSS News Feed**\n\n**Reeves boosts NHS and housing as some budgets squeezed**\nSome departments, including the Home Office and Foreign Office, have lost out in the government's Spending Review.\n\n---\n\n**Faisal Islam: This is not a quick fix, but that's the point**\nThe measures announced in the Spending Review will not instantly transform the economy.\n\n---\n\n**Seven ways the Spending Review will affect you**\nSpending limits for government departments are being outlined by the chancellor. This is how it affects you.\n\n---\n\n**Leisure centre attacked in third night of violence in Northern Ireland**\nThis comes after two days of disorder, in which 32 officers were injured and six people arrested.\n\n---\n\n**Brian Wilson, co-​creator of iconic 1960s band The Beach Boys, dies aged 82**\nHis songs including Surfin' USA, California Girls and God Only Knows have become pop music classics.\n\n---\n\n**Harvey Weinstein guilty of sexual assault after New York retrial**\nThe jury found him not guilty of an additional sexual assault charge, and have yet to return a verdict on a charge of rape.\n\n---\n\n**UK agrees post-Brexit deal over Gibraltar**\nTalks on rules governing the border of Spain and Gibraltar have been ongoing since Britain left the EU.\n\n---\n\n**Israeli forces recover bodies of two hostages in Gaza, PM says**\nOne of the two hostages was Yair Yaakov, who was killed in the Hamas-led attack on 7 October 2023, Benjamin Netanyahu says.\n\n---\n\n**Video shows crowds in Gaza scale fence to rush for aid**\nPalestinians can be seen climbing over fences and running to get humanitarian aid in the footage.\n\n---\n\n**First view of the Sun's south pole filmed by spacecraft**\nNever before seen pictures will help scientists learn how the Sun's activity changes from stormy to quiet periods\n\n---\n\n**US to partially evacuate embassy in Iraq over security threats**\nTalks between the US and Iran appear to have reached an impasse, increasing  tensions in the Middle East.\n\n---\n\n**First heat-health alerts issued for 2025 while storms bring flood risk**\nLightning, hail, gusty winds and flash flooding are likely to affect parts of the UK over the next few days.\n\n---\n\n**What has the chancellor announced? Key points at a glance**\nChancellor Rachel Reeves unveils how the government plans to spend money in the coming years.\n\n---\n\n**Welcome for housing pledge - but is it too late for some?**\nChancellor Rachel Reeves pledges £39bn across 10 years for social and affordable housing in England.\n\n---\n\n**Winners and losers: Who got what in the spending review?**\nBBC correspondents analyse how departments have fared and the impact decisions could have on you.",
  "timestamp": "2025-06-11T18:43:45.704614",
  "error": null,
  "metadata": {
    "content_type": "rss_feed",
    "items_count": 15,
    "feed_title": "RSS News Feed",
    "source": "secure_web_search",
    "original_query": "what is the latest sports news on CNN?",
    "fetch_method": "SAM_WebFetcher",
    "quarantine_timestamp": "2025-06-11T18:43:45.705061"
  }
}