{
  "url": "https://rss.nytimes.com/services/xml/rss/nyt/HomePage.xml",
  "content": "**RSS News Feed**\n\n**Senate Republicans Want to Trim Some of Trump’s Tax Cuts in Domestic Policy Bill**\nG.O.P. senators are considering whether to further curb the president’s favorite tax cuts as they rewrite key portions of the sprawling domestic agenda bill passed by the House.\n\n---\n\n**No, Not That Lee. Pentagon Finds Black Hero to Rechristen Base Long Named for Robert E.**\nThe Army unveiled a list of seven installations that the Trump administration is reverting, sort of, to earlier names venerating Confederate heroes.\n\n---\n\n**McConnell Tells Hegseth U.S. Reputation Is at Stake in Ukraine War**\nA testy exchange between a senator who strongly supports Ukraine aid and the defense secretary revealed a deepening split among G.O.P. officials on the war.\n\n---\n\n**U.S. to Evacuate Diplomats From Iraq Amid Iran Tensions**\nThe State Department said it had decided to shrink the U.S. “footprint” in Baghdad and the United Kingdom issued a warning about “increased tensions within the region.”\n\n---\n\n**Judge Ordered Jury in Weinstein Trial to Cool Down Amid Infighting**\nHarvey Weinstein said infighting in the jury was denying him a fair trial.\n\n---\n\n**Brian Wilson, Songwriter and Leader of the Beach Boys, Dies at 82**\nA hitmaker elevated and burdened by the label of genius, he transcended the breezy surf genre to create complex harmonies and intricate soundscapes in the studio.\n\n---\n\n**Beach Boy Brian Wilson’s 12 Essential Songs**\nThe Beach Boys leader, whose death was announced on Wednesday, was a brilliant writer, arranger and producer whose ambitions propelled his band — and contemporaries like the Beatles — into the future.\n\n---\n\n**Brian Wilson’s Life in Photos**\nThe Beach Boys leader was one of pop music’s most acclaimed visionaries, whose creative success was tempered by personal battles.\n\n---\n\n**Why California Says Trump’s Military Deployment Is Illegal**\nCalifornia has sued the Trump administration over its move to deploy troops to Los Angeles. Eric Schmitt, a national security correspondent for The New York Times, explains the laws governing the use of American troops on U.S. soil.\n\n---\n\n**Judge Opens Door to Releasing Mahmoud Khalil**\nMr. Khalil, a legal permanent resident, has been held in Louisiana for more than three months. The judge suggested he could be released as early as Friday unless the government successfully appeals.\n\n---\n\n**How Immigrants and Labor, Long Joined in L.A., Set the Stage for Protest**\nUnions have backed immigrant rights in California and have been on the forefront of resisting the Trump administration’s deportations.\n\n---\n\n**Trump Hails Progress With China, but Details Are Sketchy**\nTwo days of trade talks resulted in what leaders called a framework agreement meant to solidify terms of a truce that the superpowers reached in Geneva last month.\n\n---\n\n**Trump is Pushing Allies Away and Closer Into Each Other’s Arms**\nImportant U.S. allies are trying to bolster their ties as the Trump administration shifts priorities and reshapes the world order.\n\n---\n\n**How Jon Bernthal Became Hollywood’s Most Dependable Bruiser**\nJon Bernthal’s strange journey taught him to bring a surprising softness to his tough-guy characters.\n\n---\n\n**Netanyahu Under Pressure as Ultra-Orthodox Parties Threaten to Dissolve Parliament**\nThe Israeli prime minister’s coalition partners may back an opposition motion over rules that exempt most religious students from serving in the military.",
  "timestamp": "2025-06-11T18:43:45.591104",
  "error": null,
  "metadata": {
    "content_type": "rss_feed",
    "items_count": 15,
    "feed_title": "RSS News Feed",
    "source": "secure_web_search",
    "original_query": "what is the latest sports news on CNN?",
    "fetch_method": "SAM_WebFetcher",
    "quarantine_timestamp": "2025-06-11T18:43:45.591479"
  }
}